In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("p2.csv")
df

     Name   Age    City Gender              Email   Join_Date  Purchase_Amount
0  John    25.0   Delhi      M   john@example.com  2023-01-15           5000.0
1     Ana   NaN  mumbai      F   ana123@gmail.com  15/02/2023           3500.0
2   Rahul  19.0  Delhi       M          rahul@xyz  2023/03/01              NaN
3    Sara  17.0     del      F   sara@example.com  2023-03-10           2000.0
4    John  25.0   Delhi      M   john@example.com  2023-01-15           5000.0
5    Mona  22.0     Mum      f    mona@mail.com     2023/3/20           4500.0

In [3]:
df.isnull().sum()

Name               0
Age                1
City               0
Gender             0
Email              0
Join_Date          0
Purchase_Amount    1
dtype: int64

In [4]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df

     Name   Age    City Gender              Email   Join_Date  Purchase_Amount
0  John    25.0   Delhi      M   john@example.com  2023-01-15           5000.0
1     Ana  21.6  mumbai      F   ana123@gmail.com  15/02/2023           3500.0
2   Rahul  19.0  Delhi       M          rahul@xyz  2023/03/01              NaN
3    Sara  17.0     del      F   sara@example.com  2023-03-10           2000.0
4    John  25.0   Delhi      M   john@example.com  2023-01-15           5000.0
5    Mona  22.0     Mum      f    mona@mail.com     2023/3/20           4500.0

In [5]:
df['Purchase_Amount'] = df['Purchase_Amount'].fillna(df['Purchase_Amount'].median())
df

     Name   Age    City Gender              Email   Join_Date  Purchase_Amount
0  John    25.0   Delhi      M   john@example.com  2023-01-15           5000.0
1     Ana  21.6  mumbai      F   ana123@gmail.com  15/02/2023           3500.0
2   Rahul  19.0  Delhi       M          rahul@xyz  2023/03/01           4500.0
3    Sara  17.0     del      F   sara@example.com  2023-03-10           2000.0
4    John  25.0   Delhi      M   john@example.com  2023-01-15           5000.0
5    Mona  22.0     Mum      f    mona@mail.com     2023/3/20           4500.0

- Remove extra spaces from Name, City, and Email.

In [6]:
col = ['Name', 'City', 'Email']                                 # Variable = Not''
df[col] = df[col].apply(lambda col: col.str.strip())            # Use strip when removing space 
df

    Name   Age    City Gender             Email   Join_Date  Purchase_Amount
0   John  25.0   Delhi      M  john@example.com  2023-01-15           5000.0
1    Ana  21.6  mumbai      F  ana123@gmail.com  15/02/2023           3500.0
2  Rahul  19.0   Delhi      M         rahul@xyz  2023/03/01           4500.0
3   Sara  17.0     del      F  sara@example.com  2023-03-10           2000.0
4   John  25.0   Delhi      M  john@example.com  2023-01-15           5000.0
5   Mona  22.0     Mum      f     mona@mail.com   2023/3/20           4500.0

- Convert all City values to title case (e.g., Delhi, Mumbai).

In [7]:
df['City'] = df['City'].str.title()
df

    Name   Age    City Gender             Email   Join_Date  Purchase_Amount
0   John  25.0   Delhi      M  john@example.com  2023-01-15           5000.0
1    Ana  21.6  Mumbai      F  ana123@gmail.com  15/02/2023           3500.0
2  Rahul  19.0   Delhi      M         rahul@xyz  2023/03/01           4500.0
3   Sara  17.0     Del      F  sara@example.com  2023-03-10           2000.0
4   John  25.0   Delhi      M  john@example.com  2023-01-15           5000.0
5   Mona  22.0     Mum      f     mona@mail.com   2023/3/20           4500.0

##### Q3. Standardize Gender

- Fix inconsistent gender labels:
- "M", "F", "f" â†’ should become Male, Female

In [8]:
df['Gender'] = df['Gender'].str.strip().str.upper().replace({                     # We can replace values more than 1 by direct dic type value
    "M" : 'Male',                                                                 # Strip for removing space 
    "F" : 'Female'})
df

    Name   Age    City  Gender             Email   Join_Date  Purchase_Amount
0   John  25.0   Delhi    Male  john@example.com  2023-01-15           5000.0
1    Ana  21.6  Mumbai  Female  ana123@gmail.com  15/02/2023           3500.0
2  Rahul  19.0   Delhi    Male         rahul@xyz  2023/03/01           4500.0
3   Sara  17.0     Del  Female  sara@example.com  2023-03-10           2000.0
4   John  25.0   Delhi    Male  john@example.com  2023-01-15           5000.0
5   Mona  22.0     Mum  Female     mona@mail.com   2023/3/20           4500.0

In [12]:
df['Age'] = df['Age'].astype(int)
df                                      # Convert age into int

    Name  Age    City  Gender             Email   Join_Date  Purchase_Amount
0   John   25   Delhi    Male  john@example.com  2023-01-15           5000.0
1    Ana   21  Mumbai  Female  ana123@gmail.com  15/02/2023           3500.0
2  Rahul   19   Delhi    Male         rahul@xyz  2023/03/01           4500.0
3   Sara   17     Del  Female  sara@example.com  2023-03-10           2000.0
4   John   25   Delhi    Male  john@example.com  2023-01-15           5000.0
5   Mona   22     Mum  Female     mona@mail.com   2023/3/20           4500.0

In [17]:
df['Gender'] = df['Gender'].astype('category')
df['Gender'].astype                                     # Converts data type into category

<bound method NDFrame.astype of 0      Male
1    Female
2      Male
3    Female
4      Male
5    Female
Name: Gender, dtype: category
Categories (2, object): ['Female', 'Male']>

In [18]:
df = df.drop_duplicates(subset=['Name', 'Age'])
df

    Name  Age    City  Gender             Email   Join_Date  Purchase_Amount
0   John   25   Delhi    Male  john@example.com  2023-01-15           5000.0
1    Ana   21  Mumbai  Female  ana123@gmail.com  15/02/2023           3500.0
2  Rahul   19   Delhi    Male         rahul@xyz  2023/03/01           4500.0
3   Sara   17     Del  Female  sara@example.com  2023-03-10           2000.0
5   Mona   22     Mum  Female     mona@mail.com   2023/3/20           4500.0

In [25]:
cols = ['Name', 'City']
df[cols] = df[cols].apply(lambda col: col.str.strip())

C:\Users\Farhan Diwan\AppData\Local\Temp\ipykernel_19040\851831533.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[cols] = df[cols].apply(lambda col: col.str.strip())

In [26]:
df['City'] = df['City'].str.title()
df

C:\Users\Farhan Diwan\AppData\Local\Temp\ipykernel_19040\3101410479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['City'] = df['City'].str.title()

    Name  Age    City  Gender             Email   Join_Date  Purchase_Amount
0   John   25   Delhi    Male  john@example.com  2023-01-15           5000.0
1    Ana   21  Mumbai  Female  ana123@gmail.com  15/02/2023           3500.0
2  Rahul   19   Delhi    Male         rahul@xyz  2023/03/01           4500.0
3   Sara   17     Del  Female  sara@example.com  2023-03-10           2000.0
5   Mona   22     Mum  Female     mona@mail.com   2023/3/20           4500.0

In [ ]:
df['Gender'] = df['Gender'].str.strip().replace({
    'M' : 'Male',
    'F' : 'Female'})
df

In [ ]:
df['Age'] = df['Age'].astype(int)
df['Join_Date'] = pd.to_datetime(df['Join_Date'])
df'[Gender'] = df['Gender'].astype('category')

In [ ]:
df = df.drop_duplicates(subset = ['Name', 'Email'])
df

In [ ]:
df['Age_Grp'] = df['Age'].apply(lambda x: 'Adult' if x > 18 else 'Minor')
df

In [27]:
Total = df.groupby('City')['Purchase_Amount'].sum()
Total

City
Del       2000.0
Delhi     9500.0
Mum       4500.0
Mumbai    3500.0
Name: Purchase_Amount, dtype: float64